In [1]:
import pandas as pd

df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Age": [25, 30]})
df2 = pd.DataFrame({"Name": ["Charlie", "Diana"], "Age": [28, 22]})

In [2]:
df1

    Name  Age
0  Alice   25
1    Bob   30

In [3]:
df2

      Name  Age
0  Charlie   28
1    Diana   22

In [10]:
df3= pd.concat([df1, df2], ignore_index=True)

In [11]:
df3

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28
3    Diana   22

In [12]:
import pandas as pd

df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Age": [25, 30]})
df2 = pd.DataFrame({"Name2": ["Charlie", "Diana"], "Age2": [28, 22]})

In [13]:
df1

    Name  Age
0  Alice   25
1    Bob   30

In [14]:
df2

     Name2  Age2
0  Charlie    28
1    Diana    22

In [15]:
df4= pd.concat([df1, df2], ignore_index=True)

In [16]:
df4

    Name   Age    Name2  Age2
0  Alice  25.0      NaN   NaN
1    Bob  30.0      NaN   NaN
2    NaN   NaN  Charlie  28.0
3    NaN   NaN    Diana  22.0

In [19]:

df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Age": [25, 30]})
df2 = pd.DataFrame({"Name": ["Charlie", "Diana"], "Age": [28, 22]})

In [20]:
df3= pd.concat([df1, df2], ignore_index=True)

In [21]:
df3

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28
3    Diana   22

In [22]:
df3 = pd.DataFrame({"City": ["Paris", "London"]})
pd.concat([df1, df3], axis=1)

    Name  Age    City
0  Alice   25   Paris
1    Bob   30  London

In [23]:
df1 = pd.DataFrame({"Age": [25, 30]}, index=["Alice", "Bob"])
df2 = pd.DataFrame({"City": ["Paris", "London"]}, index=["Alice", "Bob"])

In [24]:
df1

       Age
Alice   25
Bob     30

In [25]:
df2

         City
Alice   Paris
Bob    London

In [26]:
df1.join(df2)

       Age    City
Alice   25   Paris
Bob     30  London

In [27]:
df1 = pd.DataFrame({"ID": [1, 2], "Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"ID": [1, 2], "City": ["Paris", "London"]})

In [28]:
df1

   ID   Name
0   1  Alice
1   2    Bob

In [29]:
df2

   ID    City
0   1   Paris
1   2  London

In [5]:
import pandas as pd

In [6]:
data = {'timestamp': ['2023-01-01 10:00:00', 
 '2023-01-01 11:00:00',
 '2023-01-02 10:00:00'],
 'value': [10, 15, 20]}
df = pd.DataFrame(data)

In [8]:
df

             timestamp  value
0  2023-01-01 10:00:00     10
1  2023-01-01 11:00:00     15
2  2023-01-02 10:00:00     20

In [17]:
time = pd.to_datetime(df['timestamp'])

In [16]:
time.dt.strftime("%d/%B.%y")

0    01/January.23
1    01/January.23
2    02/January.23
Name: timestamp, dtype: object

In [2]:
import pandas as pd

data = {
    'timestamp': ['01-01-2023 10:00 AM',
                  '01-01-2023 11:00 AM',
                  '02-01-2023 08:30 PM'],
    'value': [10, 15, 20]
}
df = pd.DataFrame(data)

print(type(df["timestamp"]))

time = pd.to_datetime(df['timestamp'], format="%d-%m-%Y %I:%M %p")

print((time))

<class 'pandas.core.series.Series'>
0   2023-01-01 10:00:00
1   2023-01-01 11:00:00
2   2023-01-02 20:30:00
Name: timestamp, dtype: datetime64[ns]

In [40]:
print(pd.date_range(start='2025-08-01',end='2025-08-29',freq = '3D'))
print(pd.date_range(start='2025-08-01',end='2025-09-29',freq = 'W')) #starts from sunday
print(pd.date_range(start='2025-08-01',end='2025-09-29',freq = pd.DateOffset(weeks = 1)))  #starts from start
print(pd.date_range(start='2025-08-01',end='2025-09-29',freq = "ME"))  #starts from 31
print(pd.date_range(start='2025-08-01',end='2025-09-29',freq = pd.DateOffset(months =1)))  #starts from 1

DatetimeIndex(['2025-08-01', '2025-08-04', '2025-08-07', '2025-08-10',
               '2025-08-13', '2025-08-16', '2025-08-19', '2025-08-22',
               '2025-08-25', '2025-08-28'],
              dtype='datetime64[ns]', freq='3D')
DatetimeIndex(['2025-08-03', '2025-08-10', '2025-08-17', '2025-08-24',
               '2025-08-31', '2025-09-07', '2025-09-14', '2025-09-21',
               '2025-09-28'],
              dtype='datetime64[ns]', freq='W-SUN')
DatetimeIndex(['2025-08-01', '2025-08-08', '2025-08-15', '2025-08-22',
               '2025-08-29', '2025-09-05', '2025-09-12', '2025-09-19',
               '2025-09-26'],
              dtype='datetime64[ns]', freq='<DateOffset: weeks=1>')
DatetimeIndex(['2025-08-31'], dtype='datetime64[ns]', freq='ME')
DatetimeIndex(['2025-08-01', '2025-09-01'], dtype='datetime64[ns]', freq='<DateOffset: months=1>')